#### 🖌 Terraform Format and Style ->`success`
#### ⚙️ Terraform Initialization ->`success`
#### 📖 Terraform Plan ->`success`

<details><summary>Show Plan</summary>

```terraform
random_uuid.ra_id: Refreshing state... [id=872df478-6ec5-2f04-f3f0-ffd17bfeb1ad]
random_integer.env: Refreshing state... [id=8772]
azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/8047fd37-2dc6-4082-bd8b-0da0ab1a24f9/resourceGroups/rg-aks-office-hours-default]
azurerm_container_registry.acr: Refreshing state... [id=/subscriptions/8047fd37-2dc6-4082-bd8b-0da0ab1a24f9/resourceGroups/rg-aks-office-hours-default/providers/Microsoft.ContainerRegistry/registries/thns8772default]
azurerm_user_assigned_identity.aks: Refreshing state... [id=/subscriptions/8047fd37-2dc6-4082-bd8b-0da0ab1a24f9/resourceGroups/rg-aks-office-hours-default/providers/Microsoft.ManagedIdentity/userAssignedIdentities/identity-aks-default]
azurerm_log_analytics_workspace.law: Refreshing state... [id=/subscriptions/8047fd37-2dc6-4082-bd8b-0da0ab1a24f9/resourceGroups/rg-aks-office-hours-default/providers/Microsoft.OperationalInsights/workspaces/law-aks-office-hours-default]
azurerm_kubernetes_cluster.aks: Refreshing state... [id=/subscriptions/8047fd37-2dc6-4082-bd8b-0da0ab1a24f9/resourcegroups/rg-aks-office-hours-default/providers/Microsoft.ContainerService/managedClusters/aks-office-hours-default]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_role_assignment.acrpull will be created
  + resource "azurerm_role_assignment" "acrpull" {
      + id                               = (known after apply)
      + name                             = "872df478-6ec5-2f04-f3f0-ffd17bfeb1ad"
      + principal_id                     = "2da9544f-1806-4407-9adf-ead3f27a58ee"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull"
      + scope                            = "/subscriptions/8047fd37-2dc6-4082-bd8b-0da0ab1a24f9/resourceGroups/rg-aks-office-hours-default/providers/Microsoft.ContainerRegistry/registries/thns8772default"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Author: @ThorstenHans, Action: `pull_request`*